---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCData.Equals(System.Object)
source: html/63954d38-65bc-3fbb-709d-de8a2086bbdb.htm
---
# Autodesk.Revit.DB.IFC.IFCData.Equals Method

Determines whether the specified Object is equal to the current Object .

## Syntax (C#)
```csharp
public override bool Equals(
	Object obj
)
```

## Parameters
- **obj** (`System.Object`) - Another object.